

export default (function getPages() {
  return [
    {
      name: "Этический идеал философии Конфуция",
      text: `
      Человека надо образовывать, так как знаний много не бывает.
      Четыре вида знания:
      * знания врожденные (высшее знание, которыми, как он сам считал, Конфуций не обладал)
      * знания от учителя
      * эмпирическое знание(результат преодоления трудностей)
      * знание с помощью рефлексии(размышления).
      Конфуций за образование, для увеличения морального духа. У Конфуция - человек изначально хорошее существо, которое надо развивать.
      Все строится на ритуалах, которые имеют метафизическое значение.
      Все основано на принципе жэнь(человеколюбие): «не делай другим того, что не хочешь, чтобы делали тебе». Все основывается на принципах уважения и любви. Такая модель управления обществом называется патриархальной.
      Конфуций, создав систему принципов, придал ей онтологический статус судьбы, каждый человек должен подчиняться принципам поведения в обществе`
    },
    {
      name: "В природе нет творения, только порождения",
      text: `
      Спиноза – нидерландский философ – пантеист.
      Монистическое учение об единой субстанции. Эта субстанция—Бог. Пантеистический Бог Спинозы безличен, он не стоит над природой, он сам есть природа.
      Но «природность» Бога ограничивает его всемогущество. Бог-Природа вынужден действовать в соответствии со своей сущностью и не может творить чудеса.
      Жесткий детерминизм. Свободы воли не существует.`
    },
    {
      name: "Предмет философии и её структура",
      text: `
      Философия как форма культуры, это профессиональная попытка объяснить мир, только при помощи специальных философских категорий. Философия – рефлексия над основаниями культуры (или над основаниями, выбор которых не всегда понятен).
      Существует единая структура философского знания. Ядром всего философского знания является метафизика, которая состоит из определенных структурных элементов:
      1. Философские вопросы:
        1. «Что лежит в основе всего бытия? Дух или материя?». Вопрос онтологий. Онтологии - философские теории бытия.
        2. «Мир дискретен или континуален?» Есть ли частицы, которые можно считать полностью элементарными или все частицы можно делить до бесконечности
        3. Происхождение движения. Вопрос в том, откуда это движение, присуще оно веществу изначально или оно привносится неким первичным источником.
        4. «Мир жестко причинно обусловлен или все события носят вероятностный характер?»
      2. Гносеология - теория познания. Существуют различные подходы:
        1. Оценочный подход – гносеологически оптимизм. В мире много еще чего непознанного, но нет ничего принципиально непознаваемого.
        2. Гносеологический пессимизм. Мир бесконечен, поэтому все познать абсолютно невозможно, и все существующие теории верны, но неполные, а полными стать никогда не смогут.
        3. Радикальный скептицизм. Лучше вообще ничего не говорить, потому что любое утверждение уязвимо.
        4. Агностицизм – полное отрицание возможности познания. Мир для человека – это комплекс его ощущений. А может ощущение — это та стена, которая отделяет вас от мира. Единственное, в чем агностик может быть уверен, что он существует сам.
      3. Аксиология – это наука о ценностях. Человек не просто живет в мире, он всегда его оценивает.
      4. Праксиология
      Самая прагматичная часть метафизики, потому что она пытается показать человеку, как надо жить в определенных условиях и чем руководствоваться.`
    },
    {
      name: "Рационалистический метод и проблема интуиции Декарта",
      text: `
      1. Необходимо признать существование врожденных идей и истин. И то, и другое познается с помощью интеллектуальной интуиции. Интеллектуальная интуиция – основа знаний.
         Первую информацию человек получает через органы чувств, но это не знание. Исходный идеи все верные, а конечные не всегда. Истинное знание постигается с помощью интуиции.
         Врожденных идей у человека ограниченное количество. Кроме врожденных идей есть врожденные аксиомы, такие как аксиомы тождества(A≡A), транзитивности(а>b, b>c, тогда a>c), закон недопустимости противоречий.
         Мы устанавливаем все эти законы, обращаясь внутрь самого себя. Для того, чтобы познать врожденные идеи достаточно, чтобы человек думал сам. Декарт не признавал вероятностей.
         Если истина есть, то она одна на веки вечные. Любой закон не может знать исключений.
      2. Аналитическая метод. Любой объект представляется как максимально сложный и нужно проанализировать его.
      3. После этого надо проводить обратный процесс из анализа простых частей создавать анализ сложного объекта.
      4. Самоконтроль. Отслеживание всех предыдущих действий

      В античности (софисты, пирронисты) сомнение было разрушительным. У Августина оно стало более конструктивным (мы можем сомневаться во всем, кроме того, что мы сомневаемся).
      Декарт возводит в абсолют эту мысль: «Я мыслю, значит существую». Без Бога ничего нельзя познать.
      Бог создал идею, внедрил её в сознание и только после этого происходит её познание, которое основано на логике и математике.`
    },
    {
      name: "Учение о пневме и эманации поздней Античности",
      text: `
      + Стоики: Представители школы считали, что надо принимать судьбу, к успехам относиться спокойно.
        У стоиков есть бог, но Бог специфический, они презирают антропоморфных (человекообразных) богов, для них существует некий Бог-пневма—огнедышащая смесь.
        Как говорит Сенека: «Пневма пронизывает мир так же как мед пронизывает соты, то есть заполняет» Такого рода учения получает называние Пантеизм.
        Бог отождествляется с природой. Эта пневма задает миропорядок и линии поведения людей.
      + Неоплатонизм: Возвращаются к мифологической философии. Поддерживают мистическую идею Платона о едином.
        Говорят, что мы не можем сказать об этом ничего рационального, но мы знаем, что благодаря этому единому мы только и можем существовать. Вводится понятия эманации.
        В начале всего происходит эманирование творческого импульса, который создает мироздание, а дальше происходит его дискретизация.
        Сначала появляется ум, который является и субъектом, и объектом, то есть он может созерцать сам себя. В этом уме находится матрица всего мира.
        После ума появляется душа, вместе с душой появляется время. Душа создает некий импульс движения мироздания. Материя тоже одушевлена.
        Из материи выделяется человек, который обладает и телесным началом и духовным. Материя — это не только конечная сущность, но и нечто, что человек может понять.
        Платон говорит: не спрашивай, почему так устроен мир, а просто понимай. `
    },
    {
      name: "Идеи диалектической логики философии Гегеля",
      text: `
      Диалектика – искусства постановки вопросов. Гегель рассуждает, как преодолеть противоречия в мире. Считает, что они не есть что-либо неразумное, останавливающее мысль, но побуждают к дальнейшему мышлению.
      Их надо «снимать», т. е. сохранять, как отрицаемое, в высшем понятии. Противоречащие друг другу понятия мыслятся вместе в третьем, более широком и богатом, в развитии которого они составляют только моменты.
      Но третье тоже будет кому-то противоречить. В итоге, мы стараемся объединить все понятие в одно единое – Абсолютное, тем самым снять противоречия, т.е. достичь истины.
      В этом и состоит суть диалектики Гегеля. Итак, положение, противоположение и их объединение (тезис – антитезис – синтез) составляют в системе Гегеля сущность, душу диалектического метода.
      Самый широкий пример этой триады – идея, природа, дух.`
    },
    {
      name: "Учение об анамнезисе в философии Платона",
      text: `
      Платон первый сформулировал закон сохранения душ. Он считал, что изначально все души живут на небесных телах (звезды, планеты и т.д.), потом вселяются в человека.
      Когда человек умирает, то душа либо возвращается на звезду (если мы хорошо себя вели), либо превращается в женщину, животное или рыбу.
      После вселения души в человеческое тело, душа забывает все об устройстве мира, которые она получила пока жила в виде планеты, звезды и тд.
      Для того, чтобы все вспомнить существует алгоритм красоты, где знание достигается с помощью диалектики (искусства постановки вопросов).
      Процесс воспоминаний, который обязательно происходит, если правильно жить, называется анамнезис. Анамнезис — это припоминание знаний, которыми душа овладела, когда была свободной.`
    },
    {
      name: "Основные функции философии и их характеристика",
      text: `
      1. Мировоззренческая функция.
        Каждый человек для себя пытается определить мир и мировоззренческие взгляды о эстетических, культурных и других идеалах человечества в целом.
      2. Методологическая функция.
      2.1. Выработка критического мышления.
           Принцип критического рационализма: ничего не принимать на веру, но не спускаться до агностицизма.
      2.2. Методология.
           Различные методы, которые появились в философии, а потом распространились в другие науки. Например, индукция, дедукция, метод вычислительного эксперимента…
      3. Прогностическая функция.
         Мы делаем прогнозы с помощью моделей, а в философии нет таких моделей, поэтому там предвиденье или прогноз носят интуитивный характер, часто неправильный, но иногда удивительно верный.
         Иногда то, что приходит в голову философу становится основным для науки.
      `
    },
    {
      name: "Проблема соотношения движения и покоя в философии досократиков",
      text: `
      Рассматриваем элейскую школу. Бытие есть, а небытия нет. Бытие неделимо и вечно, неизменно и постоянно, оно подобно большому шару.
      А всё движение, изменение, течение – это только поверхностные явления. Сама суть мира не меняется.
      Теорема Парменида: Бытие неподвижно, потому что если бы оно двигалось, то оно должно было бы двигаться в небытие, а его нет. Отсюда еще более глобальная мысль: что не мыслимо, то не существует.
      Парадоксы:
        * Про стрелы. Мы видим полет стрелы. Предположим, что пространство квантуется, тогда в каждый момент времени стрела находится в каком-то положении, то есть покоится. Как из состояний покоя может получаться движение?
        * Про Ахиллеса и черепаху. Если черепахе позволить немного отползти, то Ахиллес никогда не догонит её,
          так как в любой момент времени за любой бесконечно малый промежуток времени черепаха еще сможет отползти на бесконечно малое, но все же расстояние.
          Данный парадокс существует в рамках предположения, что пространство делимо до бесконечности.
      `
    },
    {
      name: "Философские школы в Древнем Китае. Особенности и различия",
      text: `
      * Даосизм
        Познание – это приобщение к Дао. Пути приобщения – это медитативные пути, практики. «О мире можно знать все, не выходя из своего двора» - главный принцип.
        Для даосов человек не имеет для себя особой ценности. Самый лучший правитель этот тот, о котором мало знают, а плохой, над которым смеются.
      * Конфуцианство
        См.1 билет
      * Натурфилософия (школа Инь и Ян)
        Концепция инь-ян раскрывает два положения, объясняющих природу Дао (путь человека).
        Во-первых, всё постоянно меняется. И, во-вторых, противоположности взаимодополняют друг друга (не может быть чёрного без белого, и наоборот).
        Цель человеческого существования – баланс и гармония противоположностей.
      * Мо-цзы
        Всеобщая любовь друг к другу, необходимость отказа от завоевательных войн, восхваление добродетели, экономия в тратах, сдержанность при похоронах, соблюдение воли небес, бессмысленность занятий музыкой и критика фатализма.
      * Школа исправления Имен (последователи Конфуция)
        Основная идея школы исправления имен: с течением времени вещи, которым изначально были даны правильные названия, потеряли их. Идея вернуть вещам их истинные имена.
      * Школа Легизма(школа законников)
        Основной идеей школы было равенство всех перед Законом и Сыном Неба, следствием чего являлась идея раздачи титулов не по рождению, а по реальным заслугам, согласно которой любой простолюдин имел право дослужиться до первого министра.
      `
    },
    {
      name: "Всё к лучшему в этом лучшем из миров",
      text: `
      Из романа Вольтера. Роман являет собой насмешку над многими модными в то время философскими течениями, в частности, над учением немецкого философа Лейбника, который говорил: «Бог не создал бы мира, если бы он не был лучшим из всех возможных».
      Используется как совет успокоиться и не волноваться.      `
    },
    {
      name: "Основные категории древнеиндийской философии и их характеристика",
      text: `
      Упанишады – это абстрактный блок знаний, связанный с размышлением о мироздании, о процессе познания, этических нормах.
      Онтология (метафизическое учение о бытие; основная идея: от конкретно-чувственного к абстрактному)
      В мире есть четыре первоначала - земля, вода, воздух, огонь иногда добавляют эфир.
      Потом появляются Боги, которым придается функция творения. Вводятся поколения богов (есть старые, есть более новые). Брахма – бог творец. Вишну(Кришна) – бог хранитель, Шива – бог разрушитель.
      До них был Инда – бог грома. Боги предыдущего поколения не пропадают с появлением новых, а получают иные функции в обновленной системе.
      Далее появляется образ космического(вселенского) человека – Пуруши, которого боги приносят в жертву, чтобы создать мир. Из различных частей его тела появляются разные части мироздания.
      Из глаз – Солнце, например. Далее вводятся еще более абстрактные начала, с помощью которых объясняется мироздание(вводится понятие теплоты), и более сложны образы, например, брахман - это не бог, а некое абстрактное начало, которое дополняет субъективное идеальное начало – Атман.
      Суть в том, Атман должен стремиться к Брахману, а Брахман в конечном счете и есть Атман. Надо заметить, что все строится на материальных началах. Вводится понятие «гун» - структурных элементов первичных элементов.
      Пуруша так же порождает структуру самого общества. Эта структура варн(каст), которые и сейчас имеют большое значение в Индии. Из головы Пурушы появляются брахманы – высший слой общества, из его рук появляютс Кшатрии – воины из бедер Вайшьи( ремесленники), а вот из ступней появляются Шудры.
      Гносеология (теория познания)
      Под знанием понимают не само их наличие, а человеческие качества такие как честность, смирение, усердие, подчинение учителю. Все это достигается при помощи трех ступеней познания:
      1. эмпирическое познание (особенно не доверяют);
      2. умственное познание (которому доверяют больше);
      3. познания, которая достигается при помощи интуиции, медитации, практик через просветление.
      Утверждается, что любое эмпирическое познание не может быть без умственного.
      `
    },
    {
      name: "Учение о государстве Томаса Гоббса",
      text: `
      Гоббс считает возможным проводить аналогию между государством и машиной. Государство – это некоторый сверхорганизм, который пожирает граждан.
      Власть проистекает из инстинкта самосохранения. Первобытное состояние - абсолютная свобода каждого человека. Основа - стремление к самосохранению.
      Люди с самого начала равны. Природа человека эгоистична и направлена на максимальное удовлетворение своих потребностей, а ресурсы ограничены, как следствие война всех против всех.
      Власть становится результатом конвенции, разумного решения. Возникает общественный договор. Необходимость центральной власти. Защита жизни и собственности человека, но за счет части своих свобод.
      Появляется общественная власть. Гоббс сторонник частной собственности. Один раз заключив договор, люди уже не могут его расторгнуть. Договор может быть расторгнут если власть не может больше защищать.
      Неважно какая власть будет, главное - принцип неделимости власти. Размывание власти ведет к гражданским войнам. По своей ориентации монархическая власть лучше.
      Обязанности государства: 
      1. Защита от внешних врагов.
      2. Сохранение внутреннего мира.
      3. Свобода граждан и их обогащение. Справедливость заключается в выполнении законов как со стороны государства, так и со стороны власти.
      4. Идея отчуждения. В ходе развития государства целью его развития может стать само государство. Отчуждение государства от народа.
      5. Приоритет государственной власти над церковной.
      `
    },
    {
      name: "Объективный идеализм философии Платона",
      text: `
      Материальный мир вторичен по отношение к идеальному, который существует объективно вне самого человека. Все в мире сконструировано божественным началом и преследует цель всеобщего блага.
      Ключевым становится понятие эйдос (идея, сущность), которые являются первичными по отношению ко всем чувственным вещам. По Платону первичным является мир идей, которые формирует божество, а все остальное — это отражение этих идей.
      Идеи и вещи могут взаимодействовать по причастности, по сходству, по подобию. Идеи существуют вечно, они априорны, трансцендентальны (трансцедентальное - связывающее части содержания, находящиеся по разные стороны некоторого предела).
      Зная то, что они есть, мы можем подозревать о других началах мироздания. Суть: есть 3 начала (каждое как-то называется), но они не первичны, а производные единого начала. После создания этих сущностей происходит строительство всего космоса и появляется мировая душа.
      Мировая душа — посредник между тремя трансцендентальными вещами и дальнейшими реализациями, которые есть космос, планеты и т.д. У Платона космос замкнутый и шарообразный. Земля насажена на ось этого шара в центре. Весь космос понимается одушевленным. Космос- это гигантский организм. Земля - это одна из почтеннейших богинь.
      `
    },
    {
      name: "Школа атомизма. Проблемы случайности Демокрита и Эпикура",
      text: `
      Понятия:
        * Мир делим до определенного масштаба, до определенных «твердых» сущностей, которые движутся в пустоте. Боги тоже состоят из атомов (специальных огненных атомов).
        * Всё имеет некую причину и последовательно происходит при необходимости. Этим тезисом постулируется принцип причинности и дискретности.
      Свойства атомов:
        * Движение понимается, как некоторое природное явление. Там, где существуют атомы( которых бесконечно много), там есть движение, поэтому оно есть некоторое их свойство. Приложение силы, тогда нужно для того, чтобы их остановить, а не заставить двигаться.
        * Качественно все атомы однообразны, но имеют разную форму, а разнообразие мира объясняется сцеплениями разных атомов между собой.
        * Атомы двигаются по определенным траекториям, что в итоге составляет причинно-следственную обусловленность мира. Все в мире причинно обусловлено, а случайность люди измыслили сами для себя.
      Все, что написано выше по Демокриту. Теперь различия с Эпикуром:
        * Для движения атомов необходима пустота, эпикурейцы утверждали, что пустоты нет.
        * Эпикур позже версию детерминизма отклонил, основываясь на эстетических соображениях. Если мир устроен причинно, то он лучше будет поклоняться богам, чем верить в атомистическую теорию Демокрита, потому что к богам можно обратиться, чтобы изменить свою жизнь, а к атомам нет.
          Эпикур говорил, что он чувствует, что свободен и задавался целью объяснить, почему он это чувствует. По его мнению, ответ заключался в том, что некоторые атомы спонтанно и непредсказуемо отклоняются от своих орбит. Клинамен — возможность спонтанного отклонения элементарного объекта от фиксированного порядка вещей.      `
    },
    {
      name: "Категорический императив и проблема свободы воли у Канта",
      text: `
      Термин «категорический» императив ввел И. Кант, который разрабатывал концепцию автономной этики. Согласно этой концепции, нравственные принципы существуют всегда, не зависят от окружающей среды, и должны быть в постоянной связи друг с другом.
      Человек является высшей ценностью. Каждый из людей обладает чувством собственного достоинства, которое он защищает от любых посягательств. Получается, что один человек имеет свободу выбора способа поведения через призму восприятия другого человека.
      А любой поступок оценивается на основе понятий о добре и зле. Как личность, человек не способен быть мерилом добра и зла. Следовательно, понятия о добре и зле перешли к человеку от бога. Согласно определению, человек является главной нравственной ценностью.
      Бог же для него является нравственным идеалом для самосовершенствования.
      Основы категорического императива:
        * Человек должен поступать в жизни по правилам, которые имеют силу закона, как для него, так и для других;
        * Человек должен относиться к людям так, как хочет, чтобы они относились к нему;
        * Человек не должен рассматривать другого человека как средство для извлечения личной выгоды.
      Теория Канта говорит нам о том, что человек, выбирая, как ему действовать, должен брать во внимание не только свои желания, но и общечеловеческие правила, которые являются для него безусловным повелением (категорическим императивом).
      Для человека моральный закон есть императив, который повелевает категорически, поскольку человек имеет потребности и подвержен воздействию чувственных побуждений, а значит способен к максимам, противоречащим моральному закону.
      Императив означает отношение человеческой воли к этому закону как обязательность, т.е. внутреннее разумное принуждение к нравственным поступкам. В этом заключается понятие долга.
      `
    },
    {
      name: "Учение Платона о государстве",
      text: `
      Платон считается основателем политологии. У него есть проект идеального государства, который входит в историю как первая коммунистическая утопия. Он читает, что демократия только для толпы, а мнение толпы не несет истины.
      Он считает, что во главе общества должны стоят образованные, порядочные люди. Идея: раз космос изначально благ, то ему должны соответствовать и благой человек и благое общество. Люди не знают, что это такое, поэтому философы должны им рассказать.
      В обществе должно быть 3 слоя людей, соответствующих природным началам человеческой души. Три состояния человеческой души: мудрость, ярость, вожделение. Распределяются эти моды по-разному. Есть мудрый бог - это земля, но в самой Земле неравномерно распределены благородные элементы.
      Золота мало, серебра больше, а меди много. Состояния человеческой души распределены по людям аналогично тому, как благородные металлы распределены в земле. Золото — это мудрецы, серебро — это воины, а медь — простолюдины, ремесленники, торговцы, которые не так важны сами по себе, но без них нельзя не обойтись.
      Такое общество должно быть устойчиво и эти слои не должны перемешиваться. Если же среди «меди» появится выдающийся человек, то его надо заметить и перенести в другой слой, в целом же слои отделены.
      Слой стражников является буферным слоем и именно на них должно быть направлено государственное обучение, чтобы формировать из них правящий класс. Цель государства в счастье государства, а не гражданина. Чтобы все работала, нужна жесткая дисциплина.
      По Платону браки должны заключаться только на одном социальном слое, более того жены должны быть общие, а дети не должны знать своих родителей. Все родители будет любить всех детей, а дети любить всех родителей. Вводятся так же ограничения по материальным ценностям.
      Философам не полагалось никаких ценностей. У стражников ограниченное довольствие. «Меди» разрешается иметь частное предпринимательство, зато они полностью отрешаются от власти.
      `
    },
    {
      name: "Особенности пантеизма учений Джордано Бруно и Николая Кузанского",
      text: `
      Пантеизм – религиозно-философское воззрение, отождествляющее Бога с природой.
      Николай Кузанский
      Бог есть абсолютный свет, а свет сам себя познать не может, следовательно, можно говорить только об абсолютном мраке.
      Рассматривает космос как некий шар с бесконечно большим радиусом. Так окружность фактически совпадает с прямой линией. Земля же не имеет никакого привилегированного положения, она везде и нигде. Идея о том, что космос бесконечен - это идея изотропности пространства.
      Он считал, что есть другие миры, но наш мир - привилегированный, потому что сюда приходил Бог. «Бог бесконечен, а космос безграничен».
      Математика для Кузанского – это инструмент божественного мироустройства. Он пытался объяснить понятие Троица, представив равносторонний треугольник. Будем стороны увеличивать до бесконечности, а углы приближать к прямым. Треугольник с тремя прямыми углами это и есть 59 символ Троицы.
      Математика была необходима для создания мира, т.к. идеи математики используются при космогенезе, то и человек должен использовать математику для своего творчества. 
      Джордано Бруно
      Он высказал идею единства мира: физика неба и физика земли одна и та же, и если там есть эфир, то он должен быть и на земле. Фактически он был первый, кто высказал подобные мысли. В целом его онтологические идеи следующие:
        * Идея единства мира.
        * Атомистическая модель мироздания: монады - живые единицы.
        * Идея бесконечного космоса. Космос открыт, и в нём бесконечное количество миров. Наш мир - один из многих. Есть и другие разумные миры, и может быть более разумные, чем этот. «С точки зрения могущества и благости Бога нецелесообразно было бы создать только один мир».
      `
    }
  ];
})()
