

export default (function getPages() {
  return [
    {
      name: "Этический идеал философии Конфуция",
      text: `
      Человека надо образовывать, так как знаний много не бывает.
      Четыре вида знания:
      * знания врожденные (высшее знание, которыми, как он сам считал, Конфуций не обладал)
      * знания от учителя
      * эмпирическое знание(результат преодоления трудностей)
      * знание с помощью рефлексии(размышления).
      Конфуций за образование, для увеличения морального духа. У Конфуция - человек изначально хорошее существо, которое надо развивать.
      Все строится на ритуалах, которые имеют метафизическое значение.
      Все основано на принципе жэнь(человеколюбие): «не делай другим того, что не хочешь, чтобы делали тебе». Все основывается на принципах уважения и любви. Такая модель управления обществом называется патриархальной.
      Конфуций, создав систему принципов, придал ей онтологический статус судьбы, каждый человек должен подчиняться принципам поведения в обществе`
    },
    {
      name: "В природе нет творения, только порождения",
      text: `
      Спиноза – нидерландский философ – пантеист.
      Монистическое учение об единой субстанции. Эта субстанция—Бог. Пантеистический Бог Спинозы безличен, он не стоит над природой, он сам есть природа.
      Но «природность» Бога ограничивает его всемогущество. Бог-Природа вынужден действовать в соответствии со своей сущностью и не может творить чудеса.
      Жесткий детерминизм. Свободы воли не существует.`
    },
    {
      name: "Предмет философии и её структура",
      text: `
      Философия как форма культуры, это профессиональная попытка объяснить мир, только при помощи специальных философских категорий. Философия – рефлексия над основаниями культуры (или над основаниями, выбор которых не всегда понятен).
      Существует единая структура философского знания. Ядром всего философского знания является метафизика, которая состоит из определенных структурных элементов:
      1. Философские вопросы:
        1. «Что лежит в основе всего бытия? Дух или материя?». Вопрос онтологий. Онтологии - философские теории бытия.
        2. «Мир дискретен или континуален?» Есть ли частицы, которые можно считать полностью элементарными или все частицы можно делить до бесконечности
        3. Происхождение движения. Вопрос в том, откуда это движение, присуще оно веществу изначально или оно привносится неким первичным источником.
        4. «Мир жестко причинно обусловлен или все события носят вероятностный характер?»
      2. Гносеология - теория познания. Существуют различные подходы:
        1. Оценочный подход – гносеологически оптимизм. В мире много еще чего непознанного, но нет ничего принципиально непознаваемого.
        2. Гносеологический пессимизм. Мир бесконечен, поэтому все познать абсолютно невозможно, и все существующие теории верны, но неполные, а полными стать никогда не смогут.
        3. Радикальный скептицизм. Лучше вообще ничего не говорить, потому что любое утверждение уязвимо.
        4. Агностицизм – полное отрицание возможности познания. Мир для человека – это комплекс его ощущений. А может ощущение — это та стена, которая отделяет вас от мира. Единственное, в чем агностик может быть уверен, что он существует сам.
      3. Аксиология – это наука о ценностях. Человек не просто живет в мире, он всегда его оценивает.
      4. Праксиология
      Самая прагматичная часть метафизики, потому что она пытается показать человеку, как надо жить в определенных условиях и чем руководствоваться.`
    },
    {
      name: "Рационалистический метод и проблема интуиции Декарта",
      text: `
      1. Необходимо признать существование врожденных идей и истин. И то, и другое познается с помощью интеллектуальной интуиции. Интеллектуальная интуиция – основа знаний.
         Первую информацию человек получает через органы чувств, но это не знание. Исходный идеи все верные, а конечные не всегда. Истинное знание постигается с помощью интуиции.
         Врожденных идей у человека ограниченное количество. Кроме врожденных идей есть врожденные аксиомы, такие как аксиомы тождества(A≡A), транзитивности(а>b, b>c, тогда a>c), закон недопустимости противоречий.
         Мы устанавливаем все эти законы, обращаясь внутрь самого себя. Для того, чтобы познать врожденные идеи достаточно, чтобы человек думал сам. Декарт не признавал вероятностей.
         Если истина есть, то она одна на веки вечные. Любой закон не может знать исключений.
      2. Аналитическая метод. Любой объект представляется как максимально сложный и нужно проанализировать его.
      3. После этого надо проводить обратный процесс из анализа простых частей создавать анализ сложного объекта.
      4. Самоконтроль. Отслеживание всех предыдущих действий

      В античности (софисты, пирронисты) сомнение было разрушительным. У Августина оно стало более конструктивным (мы можем сомневаться во всем, кроме того, что мы сомневаемся).
      Декарт возводит в абсолют эту мысль: «Я мыслю, значит существую». Без Бога ничего нельзя познать.
      Бог создал идею, внедрил её в сознание и только после этого происходит её познание, которое основано на логике и математике.`
    },
    {
      name: "Учение о пневме и эманации поздней Античности",
      text: `
      + Стоики: Представители школы считали, что надо принимать судьбу, к успехам относиться спокойно.
        У стоиков есть бог, но Бог специфический, они презирают антропоморфных (человекообразных) богов, для них существует некий Бог-пневма—огнедышащая смесь.
        Как говорит Сенека: «Пневма пронизывает мир так же как мед пронизывает соты, то есть заполняет» Такого рода учения получает называние Пантеизм.
        Бог отождествляется с природой. Эта пневма задает миропорядок и линии поведения людей.
      + Неоплатонизм: Возвращаются к мифологической философии. Поддерживают мистическую идею Платона о едином.
        Говорят, что мы не можем сказать об этом ничего рационального, но мы знаем, что благодаря этому единому мы только и можем существовать. Вводится понятия эманации.
        В начале всего происходит эманирование творческого импульса, который создает мироздание, а дальше происходит его дискретизация.
        Сначала появляется ум, который является и субъектом, и объектом, то есть он может созерцать сам себя. В этом уме находится матрица всего мира.
        После ума появляется душа, вместе с душой появляется время. Душа создает некий импульс движения мироздания. Материя тоже одушевлена.
        Из материи выделяется человек, который обладает и телесным началом и духовным. Материя — это не только конечная сущность, но и нечто, что человек может понять.
        Платон говорит: не спрашивай, почему так устроен мир, а просто понимай. `
    },
    {
      name: "Идеи диалектической логики философии Гегеля",
      text: `
      Диалектика – искусства постановки вопросов. Гегель рассуждает, как преодолеть противоречия в мире. Считает, что они не есть что-либо неразумное, останавливающее мысль, но побуждают к дальнейшему мышлению.
      Их надо «снимать», т. е. сохранять, как отрицаемое, в высшем понятии. Противоречащие друг другу понятия мыслятся вместе в третьем, более широком и богатом, в развитии которого они составляют только моменты.
      Но третье тоже будет кому-то противоречить. В итоге, мы стараемся объединить все понятие в одно единое – Абсолютное, тем самым снять противоречия, т.е. достичь истины.
      В этом и состоит суть диалектики Гегеля. Итак, положение, противоположение и их объединение (тезис – антитезис – синтез) составляют в системе Гегеля сущность, душу диалектического метода.
      Самый широкий пример этой триады – идея, природа, дух.`
    },
    {
      name: "Учение об анамнезисе в философии Платона",
      text: `
      Платон первый сформулировал закон сохранения душ. Он считал, что изначально все души живут на небесных телах (звезды, планеты и т.д.), потом вселяются в человека.
      Когда человек умирает, то душа либо возвращается на звезду (если мы хорошо себя вели), либо превращается в женщину, животное или рыбу.
      После вселения души в человеческое тело, душа забывает все об устройстве мира, которые она получила пока жила в виде планеты, звезды и тд.
      Для того, чтобы все вспомнить существует алгоритм красоты, где знание достигается с помощью диалектики (искусства постановки вопросов).
      Процесс воспоминаний, который обязательно происходит, если правильно жить, называется анамнезис. Анамнезис — это припоминание знаний, которыми душа овладела, когда была свободной.`
    },
    {
      name: "Основные функции философии и их характеристика",
      text: `
      1. Мировоззренческая функция.
        Каждый человек для себя пытается определить мир и мировоззренческие взгляды о эстетических, культурных и других идеалах человечества в целом.
      2. Методологическая функция.
      2.1. Выработка критического мышления.
           Принцип критического рационализма: ничего не принимать на веру, но не спускаться до агностицизма.
      2.2. Методология.
           Различные методы, которые появились в философии, а потом распространились в другие науки. Например, индукция, дедукция, метод вычислительного эксперимента…
      3. Прогностическая функция.
         Мы делаем прогнозы с помощью моделей, а в философии нет таких моделей, поэтому там предвиденье или прогноз носят интуитивный характер, часто неправильный, но иногда удивительно верный.
         Иногда то, что приходит в голову философу становится основным для науки.
      `
    },
    {
      name: "Проблема соотношения движения и покоя в философии досократиков",
      text: `
      Рассматриваем элейскую школу. Бытие есть, а небытия нет. Бытие неделимо и вечно, неизменно и постоянно, оно подобно большому шару.
      А всё движение, изменение, течение – это только поверхностные явления. Сама суть мира не меняется.
      Теорема Парменида: Бытие неподвижно, потому что если бы оно двигалось, то оно должно было бы двигаться в небытие, а его нет. Отсюда еще более глобальная мысль: что не мыслимо, то не существует.
      Парадоксы:
        * Про стрелы. Мы видим полет стрелы. Предположим, что пространство квантуется, тогда в каждый момент времени стрела находится в каком-то положении, то есть покоится. Как из состояний покоя может получаться движение?
        * Про Ахиллеса и черепаху. Если черепахе позволить немного отползти, то Ахиллес никогда не догонит её,
          так как в любой момент времени за любой бесконечно малый промежуток времени черепаха еще сможет отползти на бесконечно малое, но все же расстояние.
          Данный парадокс существует в рамках предположения, что пространство делимо до бесконечности.
      `
    },
    {
      name: "Философские школы в Древнем Китае. Особенности и различия",
      text: `
      * Даосизм
        Познание – это приобщение к Дао. Пути приобщения – это медитативные пути, практики. «О мире можно знать все, не выходя из своего двора» - главный принцип.
        Для даосов человек не имеет для себя особой ценности. Самый лучший правитель этот тот, о котором мало знают, а плохой, над которым смеются.
      * Конфуцианство
        См.1 билет
      * Натурфилософия (школа Инь и Ян)
        Концепция инь-ян раскрывает два положения, объясняющих природу Дао (путь человека).
        Во-первых, всё постоянно меняется. И, во-вторых, противоположности взаимодополняют друг друга (не может быть чёрного без белого, и наоборот).
        Цель человеческого существования – баланс и гармония противоположностей.
      * Мо-цзы
        Всеобщая любовь друг к другу, необходимость отказа от завоевательных войн, восхваление добродетели, экономия в тратах, сдержанность при похоронах, соблюдение воли небес, бессмысленность занятий музыкой и критика фатализма.
      * Школа исправления Имен (последователи Конфуция)
        Основная идея школы исправления имен: с течением времени вещи, которым изначально были даны правильные названия, потеряли их. Идея вернуть вещам их истинные имена.
      * Школа Легизма(школа законников)
        Основной идеей школы было равенство всех перед Законом и Сыном Неба, следствием чего являлась идея раздачи титулов не по рождению, а по реальным заслугам, согласно которой любой простолюдин имел право дослужиться до первого министра.
      `
    },
    {
      name: "Всё к лучшему в этом лучшем из миров",
      text: `
      Из романа Вольтера. Роман являет собой насмешку над многими модными в то время философскими течениями, в частности, над учением немецкого философа Лейбника, который говорил: «Бог не создал бы мира, если бы он не был лучшим из всех возможных».
      Используется как совет успокоиться и не волноваться.      `
    },
    {
      name: "Основные категории древнеиндийской философии и их характеристика",
      text: `
      Упанишады – это абстрактный блок знаний, связанный с размышлением о мироздании, о процессе познания, этических нормах.
      Онтология (метафизическое учение о бытие; основная идея: от конкретно-чувственного к абстрактному)
      В мире есть четыре первоначала - земля, вода, воздух, огонь иногда добавляют эфир.
      Потом появляются Боги, которым придается функция творения. Вводятся поколения богов (есть старые, есть более новые). Брахма – бог творец. Вишну(Кришна) – бог хранитель, Шива – бог разрушитель.
      До них был Инда – бог грома. Боги предыдущего поколения не пропадают с появлением новых, а получают иные функции в обновленной системе.
      Далее появляется образ космического(вселенского) человека – Пуруши, которого боги приносят в жертву, чтобы создать мир. Из различных частей его тела появляются разные части мироздания.
      Из глаз – Солнце, например. Далее вводятся еще более абстрактные начала, с помощью которых объясняется мироздание(вводится понятие теплоты), и более сложны образы, например, брахман - это не бог, а некое абстрактное начало, которое дополняет субъективное идеальное начало – Атман.
      Суть в том, Атман должен стремиться к Брахману, а Брахман в конечном счете и есть Атман. Надо заметить, что все строится на материальных началах. Вводится понятие «гун» - структурных элементов первичных элементов.
      Пуруша так же порождает структуру самого общества. Эта структура варн(каст), которые и сейчас имеют большое значение в Индии. Из головы Пурушы появляются брахманы – высший слой общества, из его рук появляютс Кшатрии – воины из бедер Вайшьи( ремесленники), а вот из ступней появляются Шудры.
      Гносеология (теория познания)
      Под знанием понимают не само их наличие, а человеческие качества такие как честность, смирение, усердие, подчинение учителю. Все это достигается при помощи трех ступеней познания:
      1. эмпирическое познание (особенно не доверяют);
      2. умственное познание (которому доверяют больше);
      3. познания, которая достигается при помощи интуиции, медитации, практик через просветление.
      Утверждается, что любое эмпирическое познание не может быть без умственного.
      `
    },
    {
      name: "Учение о государстве Томаса Гоббса",
      text: `
      Гоббс считает возможным проводить аналогию между государством и машиной. Государство – это некоторый сверхорганизм, который пожирает граждан.
      Власть проистекает из инстинкта самосохранения. Первобытное состояние - абсолютная свобода каждого человека. Основа - стремление к самосохранению.
      Люди с самого начала равны. Природа человека эгоистична и направлена на максимальное удовлетворение своих потребностей, а ресурсы ограничены, как следствие война всех против всех.
      Власть становится результатом конвенции, разумного решения. Возникает общественный договор. Необходимость центральной власти. Защита жизни и собственности человека, но за счет части своих свобод.
      Появляется общественная власть. Гоббс сторонник частной собственности. Один раз заключив договор, люди уже не могут его расторгнуть. Договор может быть расторгнут если власть не может больше защищать.
      Неважно какая власть будет, главное - принцип неделимости власти. Размывание власти ведет к гражданским войнам. По своей ориентации монархическая власть лучше.
      Обязанности государства: 
      1. Защита от внешних врагов.
      2. Сохранение внутреннего мира.
      3. Свобода граждан и их обогащение. Справедливость заключается в выполнении законов как со стороны государства, так и со стороны власти.
      4. Идея отчуждения. В ходе развития государства целью его развития может стать само государство. Отчуждение государства от народа.
      5. Приоритет государственной власти над церковной.
      `
    },
    {
      name: "Объективный идеализм философии Платона",
      text: `
      Материальный мир вторичен по отношение к идеальному, который существует объективно вне самого человека. Все в мире сконструировано божественным началом и преследует цель всеобщего блага.
      Ключевым становится понятие эйдос (идея, сущность), которые являются первичными по отношению ко всем чувственным вещам. По Платону первичным является мир идей, которые формирует божество, а все остальное — это отражение этих идей.
      Идеи и вещи могут взаимодействовать по причастности, по сходству, по подобию. Идеи существуют вечно, они априорны, трансцендентальны (трансцедентальное - связывающее части содержания, находящиеся по разные стороны некоторого предела).
      Зная то, что они есть, мы можем подозревать о других началах мироздания. Суть: есть 3 начала (каждое как-то называется), но они не первичны, а производные единого начала. После создания этих сущностей происходит строительство всего космоса и появляется мировая душа.
      Мировая душа — посредник между тремя трансцендентальными вещами и дальнейшими реализациями, которые есть космос, планеты и т.д. У Платона космос замкнутый и шарообразный. Земля насажена на ось этого шара в центре. Весь космос понимается одушевленным. Космос- это гигантский организм. Земля - это одна из почтеннейших богинь.
      `
    },
    {
      name: "Школа атомизма. Проблемы случайности Демокрита и Эпикура",
      text: `
      Понятия:
        * Мир делим до определенного масштаба, до определенных «твердых» сущностей, которые движутся в пустоте. Боги тоже состоят из атомов (специальных огненных атомов).
        * Всё имеет некую причину и последовательно происходит при необходимости. Этим тезисом постулируется принцип причинности и дискретности.
      Свойства атомов:
        * Движение понимается, как некоторое природное явление. Там, где существуют атомы( которых бесконечно много), там есть движение, поэтому оно есть некоторое их свойство. Приложение силы, тогда нужно для того, чтобы их остановить, а не заставить двигаться.
        * Качественно все атомы однообразны, но имеют разную форму, а разнообразие мира объясняется сцеплениями разных атомов между собой.
        * Атомы двигаются по определенным траекториям, что в итоге составляет причинно-следственную обусловленность мира. Все в мире причинно обусловлено, а случайность люди измыслили сами для себя.
      Все, что написано выше по Демокриту. Теперь различия с Эпикуром:
        * Для движения атомов необходима пустота, эпикурейцы утверждали, что пустоты нет.
        * Эпикур позже версию детерминизма отклонил, основываясь на эстетических соображениях. Если мир устроен причинно, то он лучше будет поклоняться богам, чем верить в атомистическую теорию Демокрита, потому что к богам можно обратиться, чтобы изменить свою жизнь, а к атомам нет.
          Эпикур говорил, что он чувствует, что свободен и задавался целью объяснить, почему он это чувствует. По его мнению, ответ заключался в том, что некоторые атомы спонтанно и непредсказуемо отклоняются от своих орбит. Клинамен — возможность спонтанного отклонения элементарного объекта от фиксированного порядка вещей.      `
    },
    {
      name: "Категорический императив и проблема свободы воли у Канта",
      text: `
      Термин «категорический» императив ввел И. Кант, который разрабатывал концепцию автономной этики. Согласно этой концепции, нравственные принципы существуют всегда, не зависят от окружающей среды, и должны быть в постоянной связи друг с другом.
      Человек является высшей ценностью. Каждый из людей обладает чувством собственного достоинства, которое он защищает от любых посягательств. Получается, что один человек имеет свободу выбора способа поведения через призму восприятия другого человека.
      А любой поступок оценивается на основе понятий о добре и зле. Как личность, человек не способен быть мерилом добра и зла. Следовательно, понятия о добре и зле перешли к человеку от бога. Согласно определению, человек является главной нравственной ценностью.
      Бог же для него является нравственным идеалом для самосовершенствования.
      Основы категорического императива:
        * Человек должен поступать в жизни по правилам, которые имеют силу закона, как для него, так и для других;
        * Человек должен относиться к людям так, как хочет, чтобы они относились к нему;
        * Человек не должен рассматривать другого человека как средство для извлечения личной выгоды.
      Теория Канта говорит нам о том, что человек, выбирая, как ему действовать, должен брать во внимание не только свои желания, но и общечеловеческие правила, которые являются для него безусловным повелением (категорическим императивом).
      Для человека моральный закон есть императив, который повелевает категорически, поскольку человек имеет потребности и подвержен воздействию чувственных побуждений, а значит способен к максимам, противоречащим моральному закону.
      Императив означает отношение человеческой воли к этому закону как обязательность, т.е. внутреннее разумное принуждение к нравственным поступкам. В этом заключается понятие долга.
      `
    },
    {
      name: "Учение Платона о государстве",
      text: `
      Платон считается основателем политологии. У него есть проект идеального государства, который входит в историю как первая коммунистическая утопия. Он читает, что демократия только для толпы, а мнение толпы не несет истины.
      Он считает, что во главе общества должны стоят образованные, порядочные люди. Идея: раз космос изначально благ, то ему должны соответствовать и благой человек и благое общество. Люди не знают, что это такое, поэтому философы должны им рассказать.
      В обществе должно быть 3 слоя людей, соответствующих природным началам человеческой души. Три состояния человеческой души: мудрость, ярость, вожделение. Распределяются эти моды по-разному. Есть мудрый бог - это земля, но в самой Земле неравномерно распределены благородные элементы.
      Золота мало, серебра больше, а меди много. Состояния человеческой души распределены по людям аналогично тому, как благородные металлы распределены в земле. Золото — это мудрецы, серебро — это воины, а медь — простолюдины, ремесленники, торговцы, которые не так важны сами по себе, но без них нельзя не обойтись.
      Такое общество должно быть устойчиво и эти слои не должны перемешиваться. Если же среди «меди» появится выдающийся человек, то его надо заметить и перенести в другой слой, в целом же слои отделены.
      Слой стражников является буферным слоем и именно на них должно быть направлено государственное обучение, чтобы формировать из них правящий класс. Цель государства в счастье государства, а не гражданина. Чтобы все работала, нужна жесткая дисциплина.
      По Платону браки должны заключаться только на одном социальном слое, более того жены должны быть общие, а дети не должны знать своих родителей. Все родители будет любить всех детей, а дети любить всех родителей. Вводятся так же ограничения по материальным ценностям.
      Философам не полагалось никаких ценностей. У стражников ограниченное довольствие. «Меди» разрешается иметь частное предпринимательство, зато они полностью отрешаются от власти.
      `
    },
    {
      name: "Особенности пантеизма учений Джордано Бруно и Николая Кузанского",
      text: `
      Пантеизм – религиозно-философское воззрение, отождествляющее Бога с природой.
      Николай Кузанский
      Бог есть абсолютный свет, а свет сам себя познать не может, следовательно, можно говорить только об абсолютном мраке.
      Рассматривает космос как некий шар с бесконечно большим радиусом. Так окружность фактически совпадает с прямой линией. Земля же не имеет никакого привилегированного положения, она везде и нигде. Идея о том, что космос бесконечен - это идея изотропности пространства.
      Он считал, что есть другие миры, но наш мир - привилегированный, потому что сюда приходил Бог. «Бог бесконечен, а космос безграничен».
      Математика для Кузанского – это инструмент божественного мироустройства. Он пытался объяснить понятие Троица, представив равносторонний треугольник. Будем стороны увеличивать до бесконечности, а углы приближать к прямым. Треугольник с тремя прямыми углами это и есть 59 символ Троицы.
      Математика была необходима для создания мира, т.к. идеи математики используются при космогенезе, то и человек должен использовать математику для своего творчества.
      Джордано Бруно
      Он высказал идею единства мира: физика неба и физика земли одна и та же, и если там есть эфир, то он должен быть и на земле. Фактически он был первый, кто высказал подобные мысли. В целом его онтологические идеи следующие:
        * Идея единства мира.
        * Атомистическая модель мироздания: монады - живые единицы.
        * Идея бесконечного космоса. Космос открыт, и в нём бесконечное количество миров. Наш мир - один из многих. Есть и другие разумные миры, и может быть более разумные, чем этот. «С точки зрения могущества и благости Бога нецелесообразно было бы создать только один мир».
      `
    },
    {
      name: "Субъективная диалектика Сёрена Кьеркегора и анализ библейского сюжета об Аврааме и Исааке",
      text: `
      Кьеркегор - глубоко религиозен. Задача: необходимо перевести разговор о Боге от имманентной сущности (вне человека) к трансцендентной (изначальное утверждение о невозможности понять Бога). Вера перед словами. «Верую, ибо нелепо» (Тертуллиан). У Кьеркегора человек и его сознание определяется автономным и свободным. Человек свободен изначально. Духовность проявляется тогда, когда человеческое сознание противостоит внешнему миру. О человеке нужно судить по его замыслам. Диалектика его человеческого сознания - иррациональность в поступках исходя из того факта, что человек изначально является греховным существом. Главный грех - смертность.
      Человек всегда боится смерти. Единственная реальная опора в этом случае - религия. Самое отчаянное положение на первой стадии, когда человек ни о чем не подозревает. Смерть - переход к новой жизни, надежда на более лучшую жизнь. Веpа должна быть трансцендентной. Пример: история об Аврааме, в которой Бог хотел, чтобы он принес в жертву своего сына. Если единичное приносится в жертву обществу, то это трагедия. С Авраамом совсем другая ситуация. Здесь личное. Зачем Бог давал сына (в 70 лет), если хочет его отнять? Зачем заставляет отца делать это? Если так происходит, то что должен делать отец? Если начать рассуждать, то сразу возникают неразрешимые пpотивоpечия и искушение отказаться от веры в Бога. Либо Авраам убийца, либо ему нужно отказаться от Бога. Глобальный вывод - слепая веpа. Веpа должна уравновесить страх, она не должна ничего объяснять. И это
      Экзистенция - ключевое понятие, философии Кьеркегора, как некая укорененность человеке в бытии, где ключевым понятием является состояние духа человека, состояния негативные, которые определяют состояние человека. Высшим же его состоянием является приход в рыцарство веры. Это субъективная диалектика Къеркигора
      `
    },
    {
      name: "Принцип энтелехии в философии Аристотеля",
      text: `
      Энтелехия – понятие древнегреческой философии, означающее действительность и завершенность всякой вещи, прежде всего живого существа, а также то, что приводит вещь из потенциального состояния к действительному существованию и удерживает ее в бытии, т.е. форму или душу.
      Термин принадлежит прежде всего контексту аристотелевского учения об акте и потенции, которое в свою очередь составляет важную часть аристотелевской метафизики: учения о сущем, о форме и материи и о движении[2]. Энтелехия, по Аристотелю, во многом тождественна энергии и есть реализация заложенных в данном сущем способностей и возможностей (в первую очередь – способности к бытию; у живого существа – к жизни); и энтелехия, и энергия противопоставляются потенции и могут означать, во-первых, процесс реализации, во-вторых, состояние реализованности, в-третьих, реализующее начало, форму («материя есть потенция, а форма – энтелехия»). Энтелехия как действительно сущее предшествует потенциальному; «действительный человек создает человека из потенциально существующего человека»).
      `
    },
    {
      name: "Майевтика Сократа и эристика софистов",
      text: `
      Майевтика - метод философствования, созданный Сократом, искусство извлекать скрытое в каждом человеке знание с помощью наводящих вопросов
      В ходе диалога Сократ вместо того, чтобы утверждать ту или иную истину, задает требующие последовательности вопросы, отвечая на которые, его собеседник формулирует дотоле неизвестные ему утверждения («рождает истину»). Отсюда и связь с повивальным делом: Сократ не делится истиной, а лишь помогает собеседнику самостоятельно создать её.
      Основные приемы:
      1. Прием иронии, с человека надо осторожно сбить спесь перед дискуссией, (ты не дурак, но и не самый умный), чтобы он к тебе соответствующе относился
      2. Метод субъективной диалектики: мы не знаем, как устроен мир, но мы можем попытаться прийти к истине. Диалектика искусства постановки вопроса, правильно уметь задавать вопросы. В вопросе содержится что-то от ответа.
      3. Индукция: если вы хотите заниматься серьезными исследованиями, то вы должны исходить из фактов. Примеры: что такое мужество? Мужество скифов, моряка, смертельно больного – не одно и то же. Исходя из многих примеров, приход к некоторым общим понятиям – наука.
      Эристика — искусство спора, диспута и полемики, разрабатывавшееся софистами. Софист – мудрец. Изначально это смысл слова был положительным, но постепенно это слово приняло негативную оценку, означающий - доказать свой тезис любой ценой. Софист как человек, ищущий свои интересы, а не истину. Философия софистов делится на две группы:
      1. Старшие – Протагор, Горгий, Гиппий.
      2. Младшие – Алкидам, Трасимах, Критий.
      Протагор объявляет, что все люди мерила всех вещей, истин столько сколько людей. Его ученик Горгий, делает все то же самое, но наоборот: «истины – не существует». Он усиливает: «если бы истина существовала, то она была невыразима», и далее: «если бы даже эта истина была бы выразима, то мы не могли бы поделиться ею с другими» нас не поймут.
      `
    },
    {
      name: "Метафизическая концепция Аристотеля",
      text: `
      Метафизика – это учение о причинах и началах бытия и знания, о том, что такое истинное бытие само по себе. «Мета» -  «то, что сидит внутри, сущность». Аристотель исключительно с помощью ума проникнуть в сущность вещей, ставил перед собой вопрос, что необходимо для существования каждой  цели в целом и общем. Он приводит несколько причин существования объектов: 
      1. Некоторая материя: гиле(первогматерия). Первоматерия – это некоторая абстракция, чистая потенция.
 2. Формальность вещи(от слова форма). Формы нельзя построить, их можно только открыть. Простейшие формы – параллелепипед, шары и другие базовые геометрически формы. Здесь явное расхождение с Платоном. У Аристотеля сущность вещей в самих вещах, а не в их идеях, существующих в своем отдельном мире.
      3. Движение. Все вещи находятся в постоянном движении. Возникает вопрос о природе этого движения. С точки зрения атомистической теории движение просто свойство атомов. Аристотель считает, что движение привносится в этот мир извне некоторым конечным перводвигателем. Импульс передается от тела к телу, поэтому все рано  или поздно приходит в движение, но конечный двигатель не должен двигаться, потому что ему не от кого получить импульс. Таким перводвигателем является Бог, который вечен и постоянно привносит движения в мир.  4. Телеоглогическая причина движения: все движение происходит не просто так, а для некоторой цели. Это свойство стремления к цели вводится через понятие энтелехиальности, то есть некоторой потенции на выполнении определенной цели, которая присуща отдельному предмету как представителю своего рода.
      Все причины в конечном счете приводят к идее существования философского Бога.      `
    },
    {
      name: "Методологический радикализм Френсиса Бэкона",
      text: `
      Он является радикальным реформистом и предлагает эмпирико-дедуктивный метод. Об индукции знал еще Аристотель, но не считал это научным рассуждением, он принимал метод силлогизма, от общего к частному. Френсис – наоборот, если вы хотите развивать знания, достичь их, то надо идти от частного к общему – индукция. Но он разделяет разные индукции: полная индукция (полный перебор - минимум научной ценности) и неполная индукция (неполный перебор – математическая статистика и теория вероятности, но больше научной индукции). Френсис Бэкон – говорит, что спекулятивно или интуитивно делать предположения нельзя, надо идти от частного к общему. Но для этого надо разделить, прежде всего, саму индукцию на определенные ее формы. Индукция через: подтверждение, опровержение (надо доказать: все лебеди белые, надо не найти не белого лебедя, чтобы доказать эту теорию), сравнение (сказка про золото).
      В онтологии Бэкон предлагает вернуться к идеям простых форм, подобий атомов. Они наиболее простые составляющие мира, а за счет движения их сцепления создается мироздание. Бэкон считал, что весь мир состоит из простых форм и задача  науки познать эти формы. Призыв науки: постигать единство форм. 
      Бэкон демократизирует науку и считает, что нет высоких и низких истин и науку надо строить исходя из естественных способностей человека:
      1. Память - цикл исторических наук.
      2. Эмоции, воля – творческие науки, поэзия, риторика, цикл психологических наук, личная истина.
      3. Разум, рассудок, рацио – все науки связанные с естествознанием, объективная истина.
      Математику он отбрасывает как науку и считает, что математика - это заблуждение.
      `
    },
    {
      name: "Возможные интерпретации концепции сверхчеловека Фридриха Ницше",
      text: `
      Сверхчеловек — образ, введённый философом Фридрихом Ницше в произведении «Так говорил Заратустра» для обозначения существа, которое по своему могуществу должно превзойти современного человека настолько, насколько последний превзошёл обезьяну.
      Персонаж Заратустра – умный писатель. Иногда спускается с гор и пытается что-то внушить простым смертным. Притча о трансформациях человеческого духа. Человек проходит три стадии развития духа. 
      1.Верблюд. Ты должен. Верблюд везет столько, сколько на него нагрузили. Ты должен, а значит - можешь – типичный верблюд. Но верблюд работает, работает, а потом падает и умирает. Что происходит с человеческим духом? Человеческий дух трансформируется во льва. 
      2.Лев. Лев - царь зверей. Я хочу. Не мне диктуют, а я диктую. Лев хорош как разрушитель, он несостоятелен как создатель. Разорвав все и вся вокруг себя, он сам вынужден погибать, ведь больше ничего нет. Поэтому, после этого дух превращается в ребенка. 
      3.Ребенок – это идеал для Ницше. Ведь ребенок всегда ориентирован на конструирование, всегда оптимистичен, всегда жизнелюб. Он творец, это для Ницше и есть идеальное воплощение воли к власти во всех смыслах.  Эти три ипостаси духа никак не связаны. Они не связаны причинно – следственной связью. Можно находиться в любом из этих трех состояний духа. И если вы проходите все эти стадии, то станете, наконец, творцом. Т.о. все рассуждения Ницше о сверхчеловеке правомерны.
      Произведение «Воля к власти», которое появилось после смерти Ницше, произвело фурор. В этом произведении выстраивалась простая схема философии «вышибал», слабого надо толкнуть, в борьбе все средства хороши, умирающему надо помочь умереть, победить должен сильнейший который может оказаться вне рамок морали. В результате этой борьбы появится супер человек.      `
    },
    {
      name: "Проблема генезиса философии",
      text: `
      Генезис - происхождение, возникновение, зарождение. 
      Вопрос генезиса философии в историко-философской науке решается неоднозначно. А.Н.Чанышев выделяет мифогенный, религиогенный и гносеогенный подходы к проблеме генезиса философии, причем первые два подхода иногда бывает трудно разделить.
      Ярким примером преимущественно религиогенного подхода является концепция Г.Гегеля, который и в мифе видел в первую очередь религиозное содержание. Согласно Гегелю, философия возникает из развитой мифологии (в Античности) и религии (из христианства в Новое время)  как средство преодоления противоречия между тем знанием о мире, которое заключено в религии, и неадекватной формой его выражения – неясным представлением. Философия же облекает это знание в форму чистого понятия, соответствующего самой основе мира.
      Мифогенный подход представлен, например, трудами А.Ф.Лосева, принципиально разделявшего мифологию и религию и считавшего, что философия возникает из безрелигиозного мифа путем дальнейшей абстрактизациии общих представлений, действительно содержащихся в развитой мифологии. Философия оказывается попыткой прочитать зашифрованное в образах мифа знание и перевести его на язык понятий. В рамках такого подхода философия часто мыслится неспособной  открыть некое новое знание по сравнению с тем, что уже скрыто содержится в мифе.
      Гносеогенный подход полагает основной предпосылкой возникновения философии развитие протонаучного знания, в первую очередь математического и астрономического, для которого характерны высокая степень абстрактности, доказательность, стремление к выявлению объективных законов, а также высокая способность к постановке проблем.
      `
    },
    {
      name: "Теория номенализма и бритва Оккама",
      text: `
      Универсалии – слова (термины), обозначающие все то, что по природе своей способно сказываться о единичных вещах (субстанциях), а именно – их свойства или отношения.
      Номинализм  – одно из основных философских направлений в решении проблемы универсалий и исторически первая форма материализма. Предметом критики для номиналистов является то, что общие имена применяются не только к классу вещей как к целому, а и порознь к каждой отдельной вещи из этого класса.
      Отсюда следует понимание понятий, обозначаемых общими именами, таких, как «человек», не как самостоятельного целого, а как совокупности отдельных понятий (конкретных людей), то есть абстракции, мысленного образа.
      Универсалии, согласно номинализму, — это имена имён, а не сущности (как для схоластического реализма) или понятия (как для концептуализма)
      Бритва Оккама — методологический принцип, он гласит:  «Не следует привлекать новые сущности без крайней на то необходимости». Этот принцип формирует базис методологического редукционизма, также называемый принципом бережливости, или законом экономии (лат. lex parsimoniae).
      Принцип «бритвы Оккама» состоит в следующем: если некое явление может быть объяснено двумя способами: например, первым — через привлечение сущностей (терминов, факторов, фактов и проч.) А, В и С, либо вторым — через сущности А, В, С и D, — и при этом оба способа дают идентичный результат, то считать верным следует первое объяснение. Сущность D в этом примере — лишняя: и её привлечение избыточно.
      `
    },
    {
      name: "Идея воли, как творческого порыва, в философии Шопенгауэра",
      text: `
      Мир как воля. Воля - это исходная движущая сила развития всего мира. Фактически Шопенгауэр считает, что воля это другое название вещи в себе. Кант объявил, что вещи в себе есть, но до них добраться невозможно. А для Шопенгауэра вещь в себе - это и есть воля. Воля к жизни. Но сначала она проходит более простые этапы своего развития. Шопенгауэр в определенном смысле повторяет Шеллинга, но не придерживается пантеизма. У Шопенгауэра воля - это импульс развития всего мироздания. Ее формы:
      1. Притяжения,
      2. Отталкивания,
      3. Магнетизм,
      4. Электричество,
      5. Гальванизм (животное электричество)
      Развитие воли вплоть до мотивированной воли человека, человек не всегда, но часто может объяснить мотивы своего поведения. Наука одна из форм реализации своей воли. Воля - это некая слепая спонтанная сила, которая ничем дальше не обосновывается, она едина и неделима. Но всегда есть разбиение общей воли на множество воль. Единая воля дробится на огромное количество воль, которые конкурируют между собой. И т.к. все ресурсы и источники жизни всегда ограничены, то происходит Дарвиновская борьба между волями. Поэтому воля носит агрессивный характер и ведет к истощению ресурсов, и к некомфортному состоянию человека. Борьба воль ведет к коллапсу. Воля есть всегда и везде, она не зависима. Следовательно, «все к худшему, в этом худшем из миров». Шопенгауэр первый задумался над пределами роста человеческой цивилизации. Даже если устранить все другие проблемы, то все равно останется проблема перенаселенности Земного шара. Борьба за существование, за ресурсы внутри стран перенесена на борьбу между странами. Поэтому все делят насильно. Шопенгауэр - пророк современного потребительского общества. Никакой наукой эту проблему не решить. Все упирается в ресурсы - в энергетические ресурсы:
      1. Искусство. Шопенгауэр считает, что музыка выражает эстетическое начало воли. Музыку точно также нельзя выразить словами. Здесь он тоже не согласен с Гегелем.
      2. Динамические начала воли. Стихии природных сил.
      3. Математическое начало воли - созерцание природного начала. Созерцание бесконечности пространственно-временных отношений.
      `
    },
    {
      name: "Идея прогресса науки и очищения человеческого разума у Френсиса Бэкона",
      text: `
      Вводит теоретическую и прикладную науку. Он говорит о светоносных теориях и плодоносных опытах. Он делает акцент на теоретическом знании - светоносном, «нет ничего практичней, чем хорошая теория». Он старается показать, что природа человека сопряжена с теми трудностями, которые он называет идолами разума т.к. его ум уже отягощен, и ему трудно перейти к новой науке. Бэкон аккумулирует в своем учении эти тропы, но для него это лишь начало деятельности для очищения человеческого разума, чтобы потом началась наука на основе опыта и эксперимента. Идолы (призраки):
       1. Идол рода – наиболее неустранимый, человек, который в силу эволюции живет в мезокосмосе (мире средних размеров). Человек ограничен в познании, ограничен в мезомире своими порогами. Мы не должны отождествлять ту информацию, которую получаем с помощью наших органов чувств. Необходимо использовать приборы, чтобы продолжать наши органы чувств. Необходимо расширять наши диапазоны и преодолевать наши пороги.
      2. Идол пещеры – люди в пещере не могут воспринимать информацию правильно. Френсис Бэкон говорит, что надо вести диалог, научные дискуссии, где можно выводить человека из его пещеры. Это принцип коммуникабельности.
 3. Идол площади или рынка - на рынке говорят на другом языке по сравнению с наукой. Проблема в том, что есть язык обыденный и научный. Но научный язык вырастает из обыденного языка, но смыслы терминов разные.
      4. Идол театра. Те глобальные философские или метафизические схемы, в которые, так или иначе, вписывается любая научная теория. Прежде чем начать заниматься новой наукой, необходимо разрушить старые метафизические схемы и конструкции.
      `
    },
    {
      name: "Понятие культуры и цивилизации у Шопенгауэра",
      text: `
      Шопенгауэр жаждал "освящения и спасения жизни". Отдельному индивидууму, а не безликой массе должна служить культура, на уникальность каждого отдельного человека должна быть ориентирована. Шопенгауэр утверждал это, как и многие другие истины, исходя из собственного опыта, а не умозрительно, для него свой собственный опыт был превыше всего. В отрешении от злой воли, формирующей реальный мир, видит Шопенгауэр счастье. Поняв бессмысленность желаний, "волений" и, не отыскав смысла существования человеческой цивилизации, он заключил, что мир, в котором мы живем, "наихудший из возможных". Однако, надежда улучшить мир, по-видимому, никогда не покидала его.
      Осмысливая собственный бытийный опыт и оглянувшись вокруг, Шопенгауэр увидел много зла и страдания, которые определяли смысл жизни без счастья. Лишь безнравственный может быть счастлив. Каждый человек должен чувствовать ответственность за зло, происходящее в мире. Зло не только доминирует, но оно источник и первооснова всего сущего, оно разлито в окружающем мире и в нас самих в виде желаний, оно определяет нашу деятельность, а следовательно культуру, которую творит человек - продукт этой злой воли. По мысли Шопенгауэра первоэлементом мира является Воля, которая, проходя через ряд ступеней объективации, достигает вершины, объективируясь в человека.
      Человек есть существо страдающее. Бытие и страдание - понятия взаимосвязанные. Шопенгауэр известен преимущественно как один из главных представителей пессимистического направления в философии. Шопенгауэр считает одной из величайших ошибок почти всех метафизических систем то, что они считают зло чем-то отрицательным; напротив, оно есть нечто положительное, нечто дающее себя чувствовать. Зло, по его мнению, неизбежно, как следствие утверждения желания жить.
      `
    },
    {
      name: "Социальные теории эпохи Возрождения",
      text: `
      Наиболее выдающимся представителем социальной философии эпохи Возрождения был Никколо Макиавелли(1469 - 1527). Макиавелли отделяет политику от теолого-религиозных представлении. Политика является воплощением свободной, человеческой воли в рамках необходимости («фортуны»). По мнению Макиавелли политику определяют не бог или мораль, а сама практика, естественные правила жизни и человеческая психология. Мотивы политической деятельности определяются реальными интересами, корыстью, стремлением к обогащению, и именно они детерминируют политическую деятельность.
      Социально-политическая теория, предложенная Макиавелли служила руководством для способного и честолюбивого правителя. По мнению Макиавелли, тот, кому «судьбой» начертана быть правителем, он должен стать правителем нового типа, абсолютным властелином, деспотом. Он не должен быть связан априорными установками, какими либо правовыми предписаниями, религией или своим собственным словом. Он должен руководствоваться строго анализированными реальными фактами, может и должен быть жестоким, беспощадным. Правитель, по Макиавелли, должен опираться не на религиозную мораль, а на мораль силы, ибо в ней отражается реальность жизни.
      Ярким представителем социальной философии эпохи Возрождения был Томас Мор (1479-1555). Он выступал против частной собственности. По его мнению, следует изменить общественные отношения, однако это нельзя сделать лишь законодательным путем, выступал за руководство целесообразное, гарантирующее справедливое распределение общественного богатства. Все люди должны иметь право и обязаны работать и т. д.
      Томмазо Кампанелла (1568—1639): провозглашает идею власти папы над всеми христианами, отстаивает единство церковной и светской власти. Он видит необходимость больших общественных преобразований, направленных на реализацию царства божьего на земле, призывает к ликвидации частной собственности и эксплуатации.
      Теория Кампанеллы, также как и Мора, утопична. Однако в ней есть много положительных идей. Например, он предсказывает огромную роль науки, говорит об образовании народа, о ликвидации войн, частной собственности, о разумном и справедливом управлении.
      `
    },
    {
      name: "Философские основания христианства",
      text: `
      Христианство - одна из самых крупных мировых религий и является самой неоднородной, существует три ветви христианства:* католичество,* православие,* протестантство,* много мелких ответвлений – секты, ереси; некоторые запрещаются на уровне государств
      Становление христианства начинается на рубеже двух эпох, когда появляется некая секта в рамках иудаизма, иудаизм - религия евреев. Евреи, утвердив свое государство в Палестине, вводят свою религию, главная книга их религии, талмуд – Этанах, талмуд очень похож на упанишады, книгу перемен и т.п. Где вперемешку присутствуют религия и элементы философии. Эклисиаст – произведение, которое лучше всего дает представление о предфилософии христианства. Эклисиаст – некто проповедующий, как написано в самой книге им является царь Соломон, однако этого не подтверждают исследования. Основные установки этого произведения:
      * Здесь прослеживается некий глобальный пессимизм в плане онтологических установок, «ничто не вечно под солнцем», «ничто в этом бытие не служит никакой опорой или надеждой».
      * Возможность познания человеком чего–либо и ценность познания подвергаются сомнению. «Кто умножает познания, тот умножает скорбь» и т.п.
       Эклисиаст – первая предпосылка христианства, но христианство несколько смягчает его положения. Этот текст входит в Старый завет. Есть еще Новый завет, который состоит из четырех евангелиев: Марка, Луки, Иоанна, Матфея. Этот Новый завет не был признан иудеями.  Иудаизм (Ветхий завет) – бога надо бояться, и ожидать его кары. Новый завет – бог уже приходил, он уже пострадал, бог – как любовь. Секта христианство развивается и испытывает жесткие гонения со стороны иудеев и римлян. Римляне, несмотря на их терпимость к богам, очень нетерпимо относились к богу христиан. Так происходит потому, что христианство предполагает всеобщее равенства перед богом. А у римлян император уже был богом при жизни. Христиане первые, кто были против этого, даже было восстание христиан в Иудее. Еще разделяло римлян и христиан идея уникальности человеческой души. Римляне проводили идею реинкарнации, закон сохранения душ, об этом говориться у Платона. Христианство повышает статус человека т.к. предполагает, что у каждого человека индивидуальная душа, как следствие, уровень ответственности с такой душой повышается. Христианство создает новый уровень общества, основанный на духовном признаке, а не на этнической общности. Христианство всегда оставалось неким цементирующим элементом в обществе. Христианство первым начало вести процесс обучения сначала в монастырях, потом в школах, потом в университетах.
      В 324 году император Константин делает христианство государственной религией. Христианство из гонимой религии становится государственной и уже христианство начинает плохо относиться к язычникам – разрушаются их храмы их искусство и т.д.
      Вводятся два понятия, обозначающие два периода становления христианства:
      * Патристика - процесс становления, канонизации догматов христианства, проходит с 0 до VI века, в это время появляются люди, которые называются отцами церкви.
      * Схоластика – VI - XIII века. В это время запрещено выдвижения чего-либо нового в христианство, лишь дозволено сравнение или комментаторство.      `
    },
    {
      name: "Принцип свободы воли в философии Августина",
      text: `
      На протяжении всей истории практически все философы спорили о том, определяет ли безошибочное Божественное предвидение человеческие поступки в будущем. В своей книге под названием «О свободной воле» Августин утверждал, что безошибочное Божественное предвидение будущего совместимо со свободной волей.
      Душа как самобытная субстанция не может быть ни телесным свойством, ни видом тела. Она не содержит в себе ничего материального, имеет лишь функцию мышления, воли, памяти, но не имеет ничего общего с биологическими функциями. Душа близка богу и бессмертна. Душу мы знаем лучше, чем тело, знание о душе является определенным, о теле же наоборот. Более того, душа, а не тело познает бога, тело же препятствует познанию. Превосходство души над телом требует, чтобы человек заботился о душе, подавлял чувственные наслаждения. Основой духовной жизни является воля, но не разум.
      Это утверждение основано на том, что сущность каждой вещи проявляется в ее активности, но не в пассивности. Отсюда вытекает заключение, что человеческую сущность характеризует не разум, который имеет пассивный характер, но действия, активная воля. Учение Августина о первенстве воли отличается от древнегреческого рационализма. Сущностью духа является свободная воля. Эту позицию Августин воплощал не только в психологии, но и в теологии: первенство воли относится и к божественной сущности. Бог сотворил мир по своей свободной воле (через посредника логос - слово). Из принципа, что бог первичен, вытекает и его положение о превосходстве души над телом, воли и чувства над разумом.
      `
    },
    {
      name: "«Человек человеку - Бог» - Людвиг Фейербах (1804 – 1872)",
      text: `
      В основу своей философии Фейербах положил "антропологический принцип", смысл которого в том, чтобы свести все сверхъестественное к природе, а сверхчеловеческое – к человеку. А в чем сущность человека, что в нем является собственно человеческим? По мнению Фейербаха, это – разум, любовь и воля. Фейербах имеет в виду, что любовь (как и разум, и воля) – абсолютная, а не относительная способность человека; любовь – цель самой себя.
      Фейербах выступил с критикой традиционных религий, утверждая, что всякий "бог" – это лишь объективированное и отчужденное человеческое "Я". Там, где главенствует религиозная вера, принцип любви осуществлен недостаточно. Вера делит людей на своих и чужих. Фейербах призывает не к отказу от религии вообще (ведь смысл религии, по его мнению, – в соединении людей), а к отказу от иллюзорных, придуманных "богов". Только при этом условии восторжествует настоящая любовь и утвердится религия любви человека к человеку.
      `
    },
    {
      name: "Теория двойственной истины в позднем Средневековье",
      text: `
      учение о философии и теологии как о двух аспектах единой истины или же о двух самостоятельных истинах. Возникла в западноевропейской философии 12—13 вв. и ассоциируется гл. о. с латинским аверроизмом, представители которого, отстаивая автономность философии, допускали возможность противоречия между научно-философскими выводами и богословскими догмами. Позиция самого Аверроэса (Ибн Рушда) скорее монистична: философская истина, оперирующая категориями и понятиями, фактически стоит выше религиозной истины, выраженной в образах и метафорах, так что в случае противоречия между тезисами разума и богооткровенными текстами последние должны подвергаться аллегорическому толкованию и приводиться в соответствие с первыми
      Другая разновидность «двойственной истины» развивалась в рамках Шартрской школы, представители которой разводили философию (науку) и теологию (религию) как по предмету, так и по методу, что исключало какое-либо противоречие между ними. Своего рода срединный вариант этой теории разрабатывал Фома Аквинский. Согласно его концепции, ставшей классической в католическом вероучении, философия и религия абсолютно различны по методу, но лишь частично — по предмету. Когда же религиозное учение не согласуется с философским выводом, первое следует признать сверхразумным; либо надлежит искать ошибку в обосновании второго.
      `
    },
    {
      name: "Проблема законов исторического развития в историческом материализме",
      text: `
      Исторический материализм появился исторически раньше, чем диалектический материализм. Как говорил сам Маркс, он достроил материализм. «Материальное - это есть идеальное пересаженное в голову и преобразованное в ней». Все наши идеи, в конечном счете, основаны на материальных предпосылках. Если в Д.М. один из основных принципов говорит: «бытие определяет сознание», то в И.М. говорится: «общественное бытие определяет общественное сознание». Общественное бытие - это вся материальная деятельность человека, его отношения с природой, а он преобразователь, а не приспособленец. Поэтому, можно описать структуру такой деятельности человека, получить законы развития и предсказать историю (как у младогегельянцев, но на основе экономической деятельности).
      1. Источник развития истории. Это Борьба классов за лучшие условия жизни. Лучшие условия жизни напрямую связаны с обладанием средств производства.
      2. Механизм развития истории. Закон перехода количественных изменений в качественные. Количественные изменения – это изменения производительной силы, которые развиваются т.к. это выгодно всем слоям общества. При достижении определенного уровня производительных сил следует качественный скачок к другим экономическим отношениям, это происходит через революции. Революции – это локомотивы истории.
      3. Направление развития. Закон отрицания отрицания. Развитие идет по спирали. Развитие направлено к коммунистическому обществу: «от каждого по способностям, каждому по потребностям», должен быть идеал свободы, свободное развитие каждого – это непременное условие для свободного развития всего общества. Ликвидация эксплуатации. Все общества были эксплуататорского типа кроме первобытнообщинного.
      `
    },
    {
      name: "Система доказательств бытия Бога у Фомы Аквинского",
      text: `
      Основной принцип его философии (католик, соединивший христианское вероучение с идеями Аристотеля) — гармония веры и разума. Он попытался рационально доказать существование Бога. Пять его доказательств:
      1. В природе происходит движение. Ничто не может начать двигаться само по себе, для этого требуется внешний источник действия. Бесконечный поиск источника предыдущего действия бессмыслен. Следовательно, должно существовать нечто, являющееся первоначальным источником всякого движения, не будучи само по себе движимо ничем иным. Это и есть Бог — недвижимый Движитель.
      2. (космологическое) Каждое следствие имеет свою причину. Бесконечный поиск предыдущей причины бессмыслен. Следовательно, должна существовать «беспричинная причина», первопричина всего последующего. Это и есть Бог.
      3.  Все предметы мира находятся во взаимосвязи и взаимоотношении друг с другом, и их существование возможно только во взаимосвязи и взаимоотношении. Однако бесконечный поиск предшествовавших друг другу взаимоотношений и взаимосвязей бессмыслен. Следовательно, должно существовать нечто, абсолютно независимое и совершенно самодостаточное. Это и есть Бог.
      4. (онтологическое) В окружающем мире наблюдается последовательное иерархическое возрастание сложности строения предметов и существ (например, от насекомого до человека), нескончаемое всеобщее стремление к совершенству. Следовательно, должно существовать нечто абсолютно совершенное, являющееся источником всякого совершенства. Это и есть Бог.
      5. (телеологическое) В окружающем мире наблюдается определенный порядок и стройность, происхождение которых невозможно приписать самому миру. Этот порядок заставляет предположить существование некоего разумного организующего начала, установившего этот порядок. Это и есть Бог.      `
    }
  ];
})()
